Revit 2024 API
IFCImportOptions.GetConversionData Method
 Get the data used in the creation of the associated Revit file for an IFC link operation, if it exists.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public LinkConversionData GetConversionData()
Visual Basic
Public Function GetConversionData As LinkConversionData
Visual C++
public:
LinkConversionData^ GetConversionData()
See Also
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace